Autodesk.Navisworks.Api.Plugins.FileMetadata
Metadata about a file or URI.

Autodesk.Navisworks.Api.Plugins.FileMetadata.#ctor
Default constructor.

Autodesk.Navisworks.Api.Plugins.FileMetadata.HasModificationTime
Is the ModificationTime property valid?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Plugins.FileMetadata.HasRevisionId
Is the RevisionId property valid?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Plugins.FileMetadata.HasSize
Is the Size property valid?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Plugins.FileMetadata.ModificationTime
The modification time of the URI.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Plugins.FileMetadata.RevisionId
The revision id of the URI.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Plugins.FileMetadata.Size
The size in bytes of the URI.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only